# RadiusY Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
Ellipse..::..RadiusY Property
Ellipse Class See Also
---
Returns the Y vector radius of the ellipse.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public double RadiusY { get; }
```

Visual Basic
---
```text
Public ReadOnly Property RadiusY As Double
	Get
```

Visual C++
---
```text
public:
property double RadiusY {
	double get ();
}
```

# See Also
Ellipse Class
Autodesk.Revit.DB Namespace